test.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2021-12-03 Fri 18:31 -->
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Special Blocks and Emacs Org-mode Export</title>
<meta name="author" content="Steve Downey" />
<meta name="generator" content="Org Mode" />

        <link rel="stylesheet" type="text/css" href="https://alhassy.github.io/org-special-block-extras/tooltipster/dist/css/tooltipster.bundle.min.css"/>

        <link rel="stylesheet" type="text/css" href="https://alhassy.github.io/org-special-block-extras/tooltipster/dist/css/plugins/tooltipster/sideTip/themes/tooltipster-sideTip-punk.min.css" />




</head>
<body>
<div id="content" class="content">
<header>
<h1 class="title">Special Blocks and Emacs Org-mode Export</h1>
</header><nav id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#orgd0f1617">1. Delete blocks and text</a></li>
<li><a href="#org1f64e6d">2. Insert blocks and text</a></li>
<li><a href="#org151b6e6">3. Comparison Table</a></li>
</ul>
</div>
</nav>
<ul class="org-ul">
<li>Document number:</li>
<li>Date:  2021-12-03</li>
<li>Author: Steve Downey &lt;sdowney2@bloomberg.net&gt;, &lt;sdowney@gmail.com&gt;</li>
<li>Audience: WG21 Emacs Authors</li>
</ul>

<div class="ABSTRACT" id="orgd7c5999">
<p>
Abstract: Making emacs org-mode more usable for writing WG21 papers.
</p>

</div>




<div id="outline-container-orgd0f1617" class="outline-2">
<h2 id="orgd0f1617"><span class="section-number-2">1.</span> Delete blocks and text</h2>
<div class="outline-text-2" id="text-1">
<del style="color: red;">
<p>
Remove this terrible old stuff.
</p>

</del>
<p>
And the bad <del style="color: red;">word</del> from this sentence.
</p>
</div>
</div>

<div id="outline-container-org1f64e6d" class="outline-2">
<h2 id="org1f64e6d"><span class="section-number-2">2.</span> Insert blocks and text</h2>
<div class="outline-text-2" id="text-2">
<ins style="color: green;">
<p>
Add this wonderful new text
</p>

</ins>
<p>
And put this cool <ins style="color: green;">word</ins> in.
</p>
</div>
</div>


<div id="outline-container-org151b6e6" class="outline-2">
<h2 id="org151b6e6"><span class="section-number-2">3.</span> Comparison Table</h2>
<div class="outline-text-2" id="text-3">
<table><thead><tr class="header"><th><div style="text-align:center"><strong>Old Busted</strong></div></th><th><div style="text-align:center"><strong>New Hotness</strong></div></th></tr></thead><tbody><tr class="odd">
<td>
<div class="org-src-container">
<pre class="src src-C++"><span class="org-type">int</span> <span class="org-variable-name">a</span> = 1 + 2 + 3;
</pre>
</div>

</td>
<td>
<div class="org-src-container">
<pre class="src src-C++"><span class="org-type">int</span> <span class="org-variable-name">a</span> = cool_sum({1, 2, 3});
</pre>
</div>

</td>

</tr></tbody></table>
</div>
</div>
</div>
</body>
</html>
